content/posts/kanban-supply-chain-optimization.md
+++
title = "Kanban Card Implementation: Why I Chose Index Cards Over Software"
author = ["desktop"]
date = 2018-08-01
layout = "list"
lastmod = 2025-12-21T09:53:27-07:00
tags = ["operations", "kanban", "kaizen", "internship", "supply-chain"]
categories = ["Portfolio"]
draft = false
technologies = ["Excel", "Infor ERP VISUAL"]
skills = ["Kanban System Design", "Process Optimization", "Lean Manufacturing Principles", "Root Cause Analysis (5-Why)", "CAPA (Corrective Action)", "Data-Driven Decision Making", "Change Management", "Stakeholder Management", "KPI Reporting"]
+++

## Overview {#overview}


### Role {#role}

Operations Intern / Supply Chain Analyst


### Objective {#objective}

Resolve critical inventory stock-outs and production delays by redesigning the component replenishment workflow.


### Context {#context}

Dynatronics (Medical Device Manufacturer) – The manufacturing floor was suffering from inefficiencies that were delaying shipments and tying up working capital.


## 1. The Strategic Choice: Adoption Over Complexity {#1-dot-the-strategic-choice-adoption-over-complexity}

The most obvious solution for a modern supply chain problem is usually "more software." However, after analyzing the environment, I realized the core challenge wasn't just data; it was ****user adoption****.

The warehouse staff was long-tenured and had established routines. I recognized that introducing a complex digital tool within my 8-week timeframe would likely meet resistance and result in low compliance.

Instead, I deliberately chose a low-friction, physical solution: a card-based ****Kanban System****.


## 2. The Solution: A Physical "Pull" System {#2-dot-the-solution-a-physical-pull-system}

I designed a visual workflow that relied on physical cards rather than computer terminals. The system worked on a simple logic:

1.  ****Visual Trigger:**** When a bin reached its designated "Safety Stock" level, a physical card was revealed.
2.  ****The Signal:**** The employee simply moved the card to an "Outbox"—no data entry required on their part.
3.  ****The Fulfillment:**** Purchasing would retrieve the cards, triggering the re-order (e.g., from vendors like McMaster-Carr).
4.  ****The Loop:**** The card returned to the bin when the item was restocked.

To secure buy-in, I worked closely with the VP of Operations, applying his coaching on change management to introduce the new process respectfully and effectively.


## 3. The Data-Driven Results {#3-dot-the-data-driven-results}

By prioritizing a system that reduced friction for the end-user, we achieved high adoption rates immediately. The impact on the supply chain KPIs was significant.

Comparing monthly averages before and after implementation, the system drove:

-   ****57.28% Decrease in Stock-outs:**** We successfully prevented distributed products from causing line stoppages.
-   ****70.38% Decrease in Past Due Orders:**** By automating the signal to purchase, we reduced administrative lag time.
-   ****Visual Organization:**** We transformed the inventory shelves from disorganized heaps to structured, labeled bins, further speeding up year-end cycle counts.


## 4. Retrospective: The RevOps Connection {#4-dot-retrospective-the-revops-connection}

While this project involved physical inventory, the principles are identical to the work I do in Revenue Operations today:

1.  ****Reduce Friction:**** The best process is the one that requires the least amount of effort from the end-user.
2.  ****Systematize the Signal:**** We moved from a "Push" forecast (guessing) to a "Pull" system (reacting to actual demand)—a concept that applies directly to lead generation and pipeline management.
3.  ****Adoption is King:**** A perfect software implementation fails if the team ignores it. Sometimes, the "low-tech" solution is the strategic choice.
